Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0256GPG064.PIC
      <edc:DCRDef edc:_addr="0x1FC45024" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC45028" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN2" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4502C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVSN3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:isidehidden="true" edc:name="DEVSN3" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SN" edc:desc="" edc:mask="0xffffffff" edc:name="SN" edc:nzwidth="32"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x00000000" edc:endaddr="0x00010000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:kuseg="0x0000000" edc:regionid="kseg0_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f802000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1_std">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="1" edc:access="-----n--nnnnnnnn--nnn---n-nnnn-n" edc:cname="CFGCON" edc:desc="" edc:impl="0xfc19f9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0--uuuuuu00--000---0-uu00-1" edc:name="CFGCON" edc:nzwidth="0x20" edc:por="-----0--xxxxxx00--000---0-xx00-1" edc:portals="- - -" ltx:baseofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ECCCON" edc:desc="Flash ECC Configuration Bits" edc:mask="0x3" edc:name="ECCCON" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IOANCPEN" edc:mask="0x1" edc:name="IOANCPEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PGLOCK" edc:desc="" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:desc="" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OCACLK" edc:desc="" edc:mask="0x1" edc:name="OCACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICACLK" edc:desc="" edc:mask="0x1" edc:name="ICACLK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN1" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN2" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN3" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN4" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMAPIN5" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWMAPIN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWAPIN6" edc:desc="PWM Alternate I/O Pin Select" edc:mask="0x1" edc:name="PWAPIN6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCPRI" edc:desc="" edc:mask="0x1" edc:name="ADCPRI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800010" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F800020" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="rrrrnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEVID" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DEVID" edc:nzwidth="0x20" edc:por="0000xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:desc="" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="28"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0xf" edc:name="VER" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800030" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYSKEY" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SYSKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:desc="" edc:mask="0xffffffff" edc:name="SYSKEY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800040" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="----------------------nn-nnn---n" edc:cname="PMD1" edc:desc="" edc:impl="0x371" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------uu-uuu---0" edc:name="PMD1" edc:nzwidth="0x20" edc:por="----------------------xx-xxx---0" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DAC1MD" edc:mask="0x1" edc:name="DAC1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC2MD" edc:mask="0x1" edc:name="DAC2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC3MD" edc:mask="0x1" edc:name="DAC3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTMUMD" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EEMD" edc:mask="0x1" edc:name="EEMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800050" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="-----------n-nnn-----------nnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0x17001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------u-uuu-----------uuu00" edc:name="PMD2" edc:nzwidth="0x20" edc:por="-----------x-xxx-----------xxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP4MD" edc:desc="" edc:mask="0x1" edc:name="CMP4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP5MD" edc:desc="" edc:mask="0x1" edc:name="CMP5MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="OPA1MD" edc:desc="" edc:mask="0x1" edc:name="OPA1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA2MD" edc:desc="" edc:mask="0x1" edc:name="OPA2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA3MD" edc:desc="" edc:mask="0x1" edc:name="OPA3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPA5MD" edc:mask="0x1" edc:name="OPA5MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800060" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuu000000000uuuuuuu000000000" edc:name="PMD3" edc:nzwidth="0x20" edc:por="xxxxxxx000000000xxxxxxx000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6MD" edc:desc="" edc:mask="0x1" edc:name="IC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9MD" edc:desc="" edc:mask="0x1" edc:name="IC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC10MD" edc:mask="0x1" edc:name="IC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11MD" edc:mask="0x1" edc:name="IC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12MD" edc:mask="0x1" edc:name="IC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13MD" edc:mask="0x1" edc:name="IC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14MD" edc:mask="0x1" edc:name="IC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15MD" edc:mask="0x1" edc:name="IC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16MD" edc:mask="0x1" edc:name="IC16MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6MD" edc:desc="" edc:mask="0x1" edc:name="OC6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7MD" edc:desc="" edc:mask="0x1" edc:name="OC7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8MD" edc:desc="" edc:mask="0x1" edc:name="OC8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9MD" edc:desc="" edc:mask="0x1" edc:name="OC9MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC10MD" edc:mask="0x1" edc:name="OC10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11MD" edc:mask="0x1" edc:name="OC11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12MD" edc:mask="0x1" edc:name="OC12MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13MD" edc:mask="0x1" edc:name="OC13MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14MD" edc:mask="0x1" edc:name="OC14MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15MD" edc:mask="0x1" edc:name="OC15MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16MD" edc:mask="0x1" edc:name="OC16MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800070" edc:_begin="0x20" edc:_end="0xb0" edc:_modsrc="DOS-02481_WACK_MC_Config.Module" edc:_refcount="2" edc:access="----nnnnnnnnnnnn-------nnnnnnnnn" edc:cname="PMD4" edc:desc="" edc:impl="0xfff01ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuuuuuuuuuu-------000000000" edc:name="PMD4" edc:nzwidth="0x20" edc:por="----xxxxxxxxxxxx-------111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="CFG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6MD" edc:desc="" edc:mask="0x1" edc:name="T6MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7MD" edc:desc="" edc:mask="0x1" edc:name="T7MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8MD" edc:desc="" edc:mask="0x1" edc:name="T8MD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9MD" edc:desc="" edc:mask="0x1" edc:name="T9MD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PWM1MD" edc:mask="0x1" edc:name="PWM1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2MD" edc:mask="0x1" edc:name="PWM2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3MD" edc:mask="0x1" edc:name="PWM3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4MD" edc:mask="0x1" edc:name="PWM4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM5MD" edc:mask="0x1" edc:name="PWM5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM6MD" edc:mask="0x1" edc:name="PWM6MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM7MD" edc:mask="0x1" edc:name="PWM7MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM8MD" edc:mask="0x1" edc:name="PWM8MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM9MD" edc:mask="0x1" edc:name="PWM9MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM10MD" edc:mask="0x1" edc:name="PWM10MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM11MD" edc:mask="0x1" edc:name="PWM11MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM12MD" edc:mask="0x1" edc:name="PWM12MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
