Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0256GPG064.PIC
      <edc:SFRDef edc:_addr="0x1F801564" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="87" edc:access="----------------------------nnnn" edc:cname="QEA6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEA6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEA6R" edc:desc="" edc:mask="0xf" edc:name="QEA6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801568" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="88" edc:access="----------------------------nnnn" edc:cname="QEB6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="QEB6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEB6R" edc:desc="" edc:mask="0xf" edc:name="QEB6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80156C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="89" edc:access="----------------------------nnnn" edc:cname="INDX6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="INDX6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INDX6R" edc:desc="" edc:mask="0xf" edc:name="INDX6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801570" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="90" edc:access="----------------------------nnnn" edc:cname="HOME6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="HOME6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HOME6R" edc:desc="" edc:mask="0xf" edc:name="HOME6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801574" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="91" edc:access="----------------------------nnnn" edc:cname="CLCINAR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINAR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINAR" edc:desc="" edc:mask="0xf" edc:name="CLCINAR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801578" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="92" edc:access="----------------------------nnnn" edc:cname="CLCINBR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINBR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINBR" edc:desc="" edc:mask="0xf" edc:name="CLCINBR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80157C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="93" edc:access="----------------------------nnnn" edc:cname="CLCINCR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINCR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINCR" edc:desc="" edc:mask="0xf" edc:name="CLCINCR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801580" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="94" edc:access="----------------------------nnnn" edc:cname="CLCINDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINDR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINDR" edc:desc="" edc:mask="0xf" edc:name="CLCINDR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801584" edc:offset="0x7C"/>
      <edc:SFRDef edc:_addr="0x1F801600" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="RPA0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA0R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA0R" edc:desc="" edc:mask="0x1f" edc:name="RPA0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801604" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="2" edc:access="---------------------------nnnnn" edc:cname="RPA1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA1R" edc:nzwidth="0x20" edc:por="---------------------------00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA1R" edc:desc="" edc:mask="0x1f" edc:name="RPA1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
